---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcGuid
source: html/77af495c-e4d7-d143-4d37-6ca9eeea0942.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcGuid Property

"IfcGUID"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcGuid { get; }
```